<a href="https://colab.research.google.com/github/xuhu357/DataAnalysis/blob/master/ch05_Pandas_2.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
from pandas import Series, DataFrame

import pandas as pd

import numpy as np

### 상관관계와 공분산

In [0]:
!pip install pandas_datareader

Requirement already satisfied: pandas_datareader in /usr/local/lib/python3.6/dist-packages (0.7.0)
Requirement already satisfied: lxml in /usr/local/lib/python3.6/dist-packages (from pandas_datareader) (4.2.5)
Requirement already satisfied: wrapt in /usr/local/lib/python3.6/dist-packages (from pandas_datareader) (1.10.11)
Requirement already satisfied: requests>=2.3.0 in /usr/local/lib/python3.6/dist-packages (from pandas_datareader) (2.18.4)
Requirement already satisfied: pandas>=0.19.2 in /usr/local/lib/python3.6/dist-packages (from pandas_datareader) (0.22.0)
Requirement already satisfied: certifi>=2017.4.17 in /usr/local/lib/python3.6/dist-packages (from requests>=2.3.0->pandas_datareader) (2018.11.29)
Requirement already satisfied: idna<2.7,>=2.5 in /usr/local/lib/python3.6/dist-packages (from requests>=2.3.0->pandas_datareader) (2.6)
Requirement already satisfied: chardet<3.1.0,>=3.0.2 in /usr/local/lib/python3.6/dist-packages (from requests>=2.3.0->pandas_datareader) (3.0.4)
Requirement already satisfied: urllib3<1.23,>=1.21.1 in /usr/local/lib/python3.6/dist-packages (from requests>=2.3.0->pandas_datareader) (1.22)
Requirement already satisfied: python-dateutil>=2 in /usr/local/lib/python3.6/dist-packages (from pandas>=0.19.2->pandas_datareader) (2.5.3)
Requirement already satisfied: numpy>=1.9.0 in /usr/local/lib/python3.6/dist-packages (from pandas>=0.19.2->pandas_datareader) (1.14.6)
Requirement already satisfied: pytz>=2011k in /usr/local/lib/python3.6/dist-packages (from pandas>=0.19.2->pandas_datareader) (2018.7)
Requirement already satisfied: six>=1.5 in /usr/local/lib/python3.6/dist-packages (from python-dateutil>=2->pandas>=0.19.2->pandas_datareader) (1.11.0)

In [0]:
import pandas as pd
from pandas_datareader import data

In [0]:
all_data = {}

for ticker in ['AAPL', 'IBM', 'MSFT','GOOG']:
  all_data[ticker] = data.DataReader(ticker, 'yahoo', '2015-01-01', '2016-01-01')
  
price = pd.DataFrame({tic: data['Adj Close'] for tic, data in all_data.items()})
volume = pd.DataFrame({tic: data['Volume'] for tic, data in all_data.items()})

In [0]:
returns = price.pct_change()

In [0]:
returns.tail()

                AAPL      GOOG       IBM      MSFT
Date
2015-12-24 -0.005340 -0.002546 -0.002093 -0.002687
2015-12-28 -0.011201  0.018854 -0.004629  0.005030
2015-12-29  0.017974  0.018478  0.015769  0.010724
2015-12-30 -0.013058 -0.007211 -0.003148 -0.004244
2015-12-31 -0.019195 -0.015720 -0.012344 -0.014740

In [0]:
price.tail()

                  AAPL        GOOG         IBM       MSFT
Date
2015-12-24  102.467850  748.400024  121.488968  52.097908
2015-12-28  101.320145  762.510010  120.926575  52.359940
2015-12-29  103.141289  776.599976  122.833458  52.921440
2015-12-30  101.794418  771.000000  122.446838  52.696846
2015-12-31   99.840477  758.880005  120.935364  51.920101

corr 메소드는 NA가 아니고, 정렬된 색인에서 연속하는 두 Series에 대해서 상관 관계를 계산하고 cov메소드는 공분산을 계산

In [0]:
returns.MSFT.corr(returns.IBM)

0.5493783907495223

In [0]:
returns.MSFT.cov(returns.IBM)

0.00013072732105472176

In [0]:
returns.corr()

          AAPL      GOOG       IBM      MSFT
AAPL  1.000000  0.381578  0.516632  0.523573
GOOG  0.381578  1.000000  0.453230  0.521243
IBM   0.516632  0.453230  1.000000  0.549378
MSFT  0.523573  0.521243  0.549378  1.000000

In [0]:
returns.cov()

          AAPL      GOOG       IBM      MSFT
AAPL  0.000284  0.000120  0.000116  0.000157
GOOG  0.000120  0.000346  0.000113  0.000173
IBM   0.000116  0.000113  0.000179  0.000131
MSFT  0.000157  0.000173  0.000131  0.000317

In [0]:
returns.corrwith(returns.IBM)

AAPL    0.516632
GOOG    0.453230
IBM     1.000000
MSFT    0.549378
dtype: float64

In [0]:
volume.head()

                  AAPL       GOOG        IBM        MSFT
Date
2015-01-02  53204600.0  1447600.0  5525500.0  27913900.0
2015-01-05  64285500.0  2059800.0  4880400.0  39673900.0
2015-01-06  65797100.0  2899900.0  6146700.0  36447900.0
2015-01-07  40105900.0  2065100.0  4701800.0  29114100.0
2015-01-08  59364500.0  3353600.0  4236800.0  29645200.0

In [0]:
returns.corrwith(volume)

AAPL   -0.119290
GOOG    0.406530
IBM    -0.302053
MSFT   -0.002987
dtype: float64

### 유일값, 값 세기, 멤버십

In [0]:
obj = Series(['c', 'a', 'd', 'a', 'a', 'b', 'b', 'c', 'c'])

In [0]:
uniques = obj.unique()

In [0]:
uniques

array(['c', 'a', 'd', 'b'], dtype=object)

Unique는 말그대로 유일한 값을 찾아주는 것이지, 정렬까지는 책임져 주지 않는다.

In [0]:
obj.value_counts()

c    3
a    3
b    2
d    1
dtype: int64

In [0]:
pd.value_counts(obj.values, sort=False)

a    3
d    1
b    2
c    3
dtype: int64

In [0]:
pd.value_counts(obj.values)

c    3
a    3
b    2
d    1
dtype: int64

특정 값을 가진 부분 row만을 선택하고 싶을 때,

In [0]:
mask = obj.isin(['b', 'd'])

In [0]:
mask

0    False
1    False
2     True
3    False
4    False
5     True
6     True
7    False
8    False
dtype: bool

In [0]:
obj[mask]

2    d
5    b
6    b
dtype: object

**정리해보면, **

* isin: Series의 각 원소가 넘겨 받은 연속된 값에 속하는지를 나타내는 불리언 배열을 반환.
* unique: Series에서 중복되는 값을 제거하고 , 유일한 값만 포함하는 배열을 반환. 결과는 Series에서 발견된 순서대로 반환.
* value_counts: Series에서 유일 값에 대한 색인 값과 도수를 계산. 결과는 도수 값의 내림차순으로 정렬.

In [0]:
data = DataFrame(
    {
        'Qu1': [1, 3, 4, 3, 4],
        'Qu2': [2, 3, 1, 2, 3], 
        'Qu3': [1, 5, 2, 4, 4]
    }
)

In [0]:
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [0]:
data.apply(pd.value_counts).fillna(0) # 없는 값은 0으로 채우자~

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0

In [0]:
data.apply(pd.value_counts, axis=1).fillna(0) # column에 대해서 적용해보자

     1    2    3    4    5
0  2.0  1.0  0.0  0.0  0.0
1  0.0  0.0  2.0  0.0  1.0
2  1.0  1.0  0.0  1.0  0.0
3  0.0  1.0  1.0  1.0  0.0
4  0.0  0.0  1.0  2.0  0.0

## 누락된 데이터 처리하기

In [0]:
str_data = Series(['aardvark', 'artichoke', np.nan, 'avocado'])

In [0]:
str_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [0]:
str_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [0]:
str_data[0] = None

In [0]:
str_data

0         None
1    artichoke
2          NaN
3      avocado
dtype: object

In [0]:
str_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

**NA 처리 메소드**

* dropna: 누락된 데이터가 있는 축을 제외. 어느 정도 누락 데이터까지 용인할 것인지 지정 가능
* fillna: 누락된 데이터를 대신할 값을 채우거나 ffill 또는 bfill같은 보간 메소드를 적용
* isnull: 누락되거나 NA 값을 알려주는 불리언 값이 저장된, 같은 형태의 객체를 반환
* notnull: isnull과 반대되는 메소드

### 누락된 데이터 골라내기

In [0]:
from numpy import nan as NA

In [0]:
data = Series([1, NA, 3.5, NA, 7])

In [0]:
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [0]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [0]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

**DataFrame인 경우는 조금 복잡함**. 

모두 NA인 row, column을 제외하든가, 하나라도 NA인 값을 포함하고 있는 row, column을 제외 시킬수도 있다. dropna는 기본적으로 NA값이 하나라도 있는 row는 제외시킨다.

In [0]:
data = DataFrame([
    [1., 6.5, 3.], 
    [1., NA, NA], 
    [NA, NA, NA],
    [NA, 6.5, 3.]
])

In [0]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [0]:
cleaned = data.dropna()

In [0]:
cleaned

     0    1    2
0  1.0  6.5  3.0

dropna()는 옵션을 주지 않으면, NA가 하나라도 있으면 모두 drop 해버림.

In [0]:
data.dropna(how='all') # 모두 na일때에만 drop해라~

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [0]:
data.dropna(thresh=2) # NA가 thresh보다 같거나 큰애들을 drop 시켜라.

     0    1    2
0  1.0  6.5  3.0
3  NaN  6.5  3.0

### 누락된 값 채우기

In [0]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [0]:
data.fillna(0)

     0    1    2
0  1.0  6.5  3.0
1  1.0  0.0  0.0
2  0.0  0.0  0.0
3  0.0  6.5  3.0

일괄적으로 다 한개의 값으로 채우는것도 나쁘지는 않지만, 각 column별로 값을 다르게 주고 싶다면,

In [0]:
data.fillna({1: 100, 2: 200})

     0      1      2
0  1.0    6.5    3.0
1  1.0  100.0  200.0
2  NaN  100.0  200.0
3  NaN    6.5    3.0

In [0]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

보다 싶이 지금까지는 원본은 변경하지 않았음. 그러나 inplace=True를 통해서 원본을 변경 가능

In [0]:
data.fillna(0, inplace=True)

In [0]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  0.0  0.0
2  0.0  0.0  0.0
3  0.0  6.5  3.0

**Let's see another example~**

In [0]:
df = DataFrame(np.random.randn(6, 3))

In [0]:
df.iloc[2: , 1] = NA; df.iloc[4: , 2] = NA

In [0]:
df

          0         1         2
0 -0.304413 -1.721575 -0.561524
1 -0.959479 -1.363486  0.458727
2  0.799033       NaN -0.075438
3  1.346836       NaN -0.389948
4 -0.420924       NaN       NaN
5 -0.421729       NaN       NaN

In [0]:
df.fillna(method='ffill') # front fill? 값이 없으면, 내 앞의 값으로 채워라~

          0         1         2
0 -0.304413 -1.721575 -0.561524
1 -0.959479 -1.363486  0.458727
2  0.799033 -1.363486 -0.075438
3  1.346836 -1.363486 -0.389948
4 -0.420924 -1.363486 -0.389948
5 -0.421729 -1.363486 -0.389948

In [0]:
df.fillna(method='ffill', limit=2) # 이 메소드를 죽을때까지 우려먹지말고 limit을 주자, 여기는 2번까지만 사용해라~

          0         1         2
0 -0.304413 -1.721575 -0.561524
1 -0.959479 -1.363486  0.458727
2  0.799033 -1.363486 -0.075438
3  1.346836 -1.363486 -0.389948
4 -0.420924       NaN -0.389948
5 -0.421729       NaN -0.389948

another example~

In [0]:
data = Series([1., NA, 3.5, NA, 7])

In [0]:
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

이번에는 평균으로 채워보자~

In [0]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

## 계층적 색인 (Hierarchical indexing)

판다스의 주요 기능으로써, 축에 대한 다중 색인 단계를 지정할 수 있음.

추상적으로 표현하자면, 차원이 높은 데이터를 차원이 낮은 형식으로 다룰수 있게 해주는 기능

In [0]:
data = Series(np.random.randn(10), index = [['a', 'a', 'a', 'b', 'b', 'b', 'c','c', 'd', 'd'], [1, 2, 3, 1, 2, 3, 1, 2, 2, 3]])

In [0]:
data

a  1   -0.768029
   2    0.664488
   3   -0.376515
b  1    1.050230
   2   -1.406699
   3    1.925991
c  1   -0.906054
   2    1.447778
d  2    0.279895
   3    0.035328
dtype: float64

In [0]:
data.index

MultiIndex(levels=[['a', 'b', 'c', 'd'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1, 2, 2, 3, 3], [0, 1, 2, 0, 1, 2, 0, 1, 1, 2]])

In [0]:
data['b']

1    1.050230
2   -1.406699
3    1.925991
dtype: float64

In [0]:
data['d']

2    0.279895
3    0.035328
dtype: float64

In [0]:
data['b':'c']

b  1    1.050230
   2   -1.406699
   3    1.925991
c  1   -0.906054
   2    1.447778
dtype: float64

In [0]:
data[['b', 'd']]

b  1    1.050230
   2   -1.406699
   3    1.925991
d  2    0.279895
   3    0.035328
dtype: float64

In [0]:
data['b', 2]

-1.4066994729069024

In [0]:
data[:, 3]

a   -0.376515
b    1.925991
d    0.035328
dtype: float64

계층적 색인은 데이터를 재형성, reshape하고, pivot_table 같은 그룹 기반의 작업을 할 때 중요하게 사용된다. 

예를 들어, DataFrame 객체에 unstack 메소드를 사용해서, 데이터를 새롭게 배열할 수 있다.

In [0]:
data

a  1   -0.768029
   2    0.664488
   3   -0.376515
b  1    1.050230
   2   -1.406699
   3    1.925991
c  1   -0.906054
   2    1.447778
d  2    0.279895
   3    0.035328
dtype: float64

In [0]:
data.unstack(-1)

          1         2         3
a -0.768029  0.664488 -0.376515
b  1.050230 -1.406699  1.925991
c -0.906054  1.447778       NaN
d       NaN  0.279895  0.035328

In [0]:
data.unstack().unstack()

1  a   -0.768029
   b    1.050230
   c   -0.906054
   d         NaN
2  a    0.664488
   b   -1.406699
   c    1.447778
   d    0.279895
3  a   -0.376515
   b    1.925991
   c         NaN
   d    0.035328
dtype: float64

다시 돌아와서

In [0]:
data

a  1   -0.768029
   2    0.664488
   3   -0.376515
b  1    1.050230
   2   -1.406699
   3    1.925991
c  1   -0.906054
   2    1.447778
d  2    0.279895
   3    0.035328
dtype: float64

In [0]:
data.unstack(0)

          a         b         c         d
1 -0.768029  1.050230 -0.906054       NaN
2  0.664488 -1.406699  1.447778  0.279895
3 -0.376515  1.925991       NaN  0.035328

**DataFrame의 두축 모두 계층적 색인 가질수 있다. **

In [0]:
frame = DataFrame(np.arange(12).reshape((4, 3)), 
                 index=[['a', 'a', 'b', 'b'], [1, 2, 1, 2]], 
                  columns = [['Ohio', 'Ohio', 'Colorado'], ['Green', 'Red', 'Green']]
                 )

In [0]:
frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

**계층적 색인의 각 단계는 이름을 가질수 있고, 만약 이름이 있다면, 콘솔 출력 시에 함께 나타난다. **

In [0]:
frame.index.names = ['key1', 'key2']

In [0]:
frame

           Ohio     Colorado
          Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

Column에도 이름을 줘보자

In [0]:
frame.columns.names = ['State', 'Color']

In [0]:
frame

State      Ohio     Colorado
Color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [0]:
frame['Ohio']

Color      Green  Red
key1 key2
a    1         0    1
     2         3    4
b    1         6    7
     2         9   10

In [0]:
frame.index.labels

FrozenList([[0, 0, 1, 1], [0, 1, 0, 1]])

In [0]:
frame.index.names

FrozenList(['key1', 'key2'])

이젠 본격적으로 data frame의 다중색인에 대해서 알아보자

In [0]:
frame

State      Ohio     Colorado
Color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [0]:
frame.index

MultiIndex(levels=[['a', 'b'], [1, 2]],
           labels=[[0, 0, 1, 1], [0, 1, 0, 1]],
           names=['key1', 'key2'])

In [0]:
frame.loc['a']

State  Ohio     Colorado
Color Green Red    Green
key2
1         0   1        2
2         3   4        5

In [0]:
frame.loc['a': 'b']

State      Ohio     Colorado
Color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

그럼 key1은 아무거나이고, key2가 2인 항목만 추출하고 싶다면, 어떻게 할까?

In [0]:
frame.loc['a':'b', 2] # 'a' ~ 'b' 까지, key2가 2인 애들만 뽑자인데

In [0]:
frame.loc[('a':'b', 2)]

SyntaxError: ignored

뭐지? 2를 column으로 준게 아닌데~ 2가 숫자여서 그런가? 그럼 문자 index로 다시 테스트

In [0]:
frame = DataFrame(np.arange(12).reshape((4, 3)), 
                 index=[['a', 'a', 'b', 'b'], ['one', 'two', 'one', 'two']], 
                  columns = [['Ohio', 'Ohio', 'Colorado'], ['Green', 'Red', 'Green']]
                 )

In [0]:
frame

       Ohio     Colorado
      Green Red    Green
a one     0   1        2
  two     3   4        5
b one     6   7        8
  two     9  10       11

In [0]:
frame.index

MultiIndex(levels=[['a', 'b'], ['one', 'two']],
           labels=[[0, 0, 1, 1], [0, 1, 0, 1]])

In [0]:
frame.loc['b']

     Ohio     Colorado
    Green Red    Green
one     6   7        8
two     9  10       11

In [0]:
frame.loc['b', 'two']

Ohio      Green     9
          Red      10
Colorado  Green    11
Name: (b, two), dtype: int64

In [0]:
frame.loc[[('a', 'two'), ('b', 'two')]]

       Ohio     Colorado
      Green Red    Green
a two     3   4        5
b two     9  10       11

### 퀴즈, frame에서 key2가 'two' 인 데이터만 뽑고 싶다면, 어떻게 해야 할까요?

슬라이싱(:)을 써줘야 하는데 아래와 같이 쓰면, 에러 발생함.

In [0]:
frame.loc[:, 'two']

In [0]:
frame.loc[(:, 'two')]

SyntaxError: ignored

#### MultiIndexing에서는 슬라이싱을 slice로 표시

In [0]:
frame

       Ohio     Colorado
      Green Red    Green
a one     0   1        2
  two     3   4        5
b one     6   7        8
  two     9  10       11

In [0]:
frame.loc[(slice('a', 'b'), 'two'), 'Colorado']

       Green
a two      5
b two     11

In [0]:
frame.loc[(slice(None), 'two'), 'Colorado']

       Green
a two      5
b two     11

혹은 판다스에서 제공하는 IndexSlice를 사용하자~

In [0]:
idx = pd.IndexSlice

In [0]:
frame

       Ohio     Colorado
      Green Red    Green
a one     0   1        2
  two     3   4        5
b one     6   7        8
  two     9  10       11

In [0]:
frame.loc[idx[:, 'one'], :]

       Ohio     Colorado
      Green Red    Green
a one     0   1        2
b one     6   7        8

In [0]:
frame.loc[(slice(None), 'one'), :]

       Ohio     Colorado
      Green Red    Green
a one     0   1        2
b one     6   7        8

In [0]:
frame.loc[(slice(None), slice(None)), 'Colorado']

       Green
a one      2
  two      5
b one      8
  two     11

DataFrame의 multi index에서 ' : ' 이 먹히지 않는게 신기했음.

### 계층 순서 바꾸고 정렬하기

In [0]:
frame = DataFrame(np.arange(12).reshape((4, 3)), 
                 index=[['a', 'a', 'b', 'b'], ['one', 'two', 'one', 'two']], 
                  columns = [['Ohio', 'Ohio', 'Colorado'], ['Green', 'Red', 'Green']]
                 )

In [3]:
frame

       Ohio     Colorado
      Green Red    Green
a one     0   1        2
  two     3   4        5
b one     6   7        8
  two     9  10       11

In [0]:
frame.index.names = ['key1', 'key2']

In [5]:
frame

           Ohio     Colorado
          Green Red    Green
key1 key2
a    one      0   1        2
     two      3   4        5
b    one      6   7        8
     two      9  10       11

In [6]:
frame.swaplevel('key1', 'key2')

           Ohio     Colorado
          Green Red    Green
key2 key1
one  a        0   1        2
two  a        3   4        5
one  b        6   7        8
two  b        9  10       11

In [7]:
frame.sortlevel(1)

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:1: FutureWarning: sortlevel is deprecated, use sort_index(level= ...)
  """Entry point for launching an IPython kernel.

           Ohio     Colorado
          Green Red    Green
key1 key2
a    one      0   1        2
b    one      6   7        8
a    two      3   4        5
b    two      9  10       11

In [8]:
frame.sort_index(level=0)

           Ohio     Colorado
          Green Red    Green
key1 key2
a    one      0   1        2
     two      3   4        5
b    one      6   7        8
     two      9  10       11

In [9]:
frame.sort_index(level=1)

           Ohio     Colorado
          Green Red    Green
key1 key2
a    one      0   1        2
b    one      6   7        8
a    two      3   4        5
b    two      9  10       11

In [11]:
frame.swaplevel(0, 1).sort_index(level=1)

           Ohio     Colorado
          Green Red    Green
key2 key1
one  a        0   1        2
two  a        3   4        5
one  b        6   7        8
two  b        9  10       11

### 단계별 요약 통계

DataFrame과 Series의 많은 기술통계와 요약 통계는 level옵션을 가지고 있는데, 이는 어떠한 축에 대해 합을 구하고 싶은 단계를 지정할 수 있는 옵션이다.

In [12]:
frame

           Ohio     Colorado
          Green Red    Green
key1 key2
a    one      0   1        2
     two      3   4        5
b    one      6   7        8
     two      9  10       11

In [13]:
frame.sum(level=1)

      Ohio     Colorado
     Green Red    Green
key2
one      6   8       10
two     12  14       16

In [0]:
frame.columns.names = ['State', 'Color']

In [15]:
frame

State      Ohio     Colorado
Color     Green Red    Green
key1 key2
a    one      0   1        2
     two      3   4        5
b    one      6   7        8
     two      9  10       11

In [16]:
frame.sum(axis = 1, level='Color')

Color      Green  Red
key1 key2
a    one       2    1
     two       8    4
b    one      14    7
     two      20   10

### DataFrame의 칼럼 사용하기

DataFrame에서 로우를 선택하기 위한 색인으로 하나 이상의 칼럼을 사용하는것은 드물지 않을 일.

로우의 색인을 DataFrame의 칼럼으로 옮기고 싶은 경우도 있을 수 있다.

In [0]:
frame = DataFrame({
    'a' : range(7), 
    'b' : range(7, 0, -1),
    'c' : ['one', 'one', 'one', 'two', 'two', 'two', 'two'],
    'd' : [0, 1, 2, 0, 1, 2, 3]
})

In [18]:
frame

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

DataFrame의 set_index는 하나 이상의 칼럼을 색인으로 하는 새로운 DataFrame을 생성

In [0]:
frame2 = frame.set_index(['c', 'd'])

In [20]:
frame2

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

만약 index로 사용하면서 칼럼으로도 유지하고 싶다면,

In [0]:
frame3 = frame.set_index(['c', 'd'], drop=False)

In [22]:
frame3

       a  b    c  d
c   d
one 0  0  7  one  0
    1  1  6  one  1
    2  2  5  one  2
two 0  3  4  two  0
    1  4  3  two  1
    2  5  2  two  2
    3  6  1  two  3

칼럼 c, d 가 그대로 남아 있는것을 확인 할 수 있음.

---


반면에 reset_index 함수는 set_index와 반대되는 개념으로 계층적 색인 단계가 column으로 이동.

In [24]:
frame2.reset_index().sort_index(axis=1)

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

## Pandas와 관련된 기타 주제

### 정수 색인

pandas 객체를 정수로 색인해서 사용하는 일은 python에서 리스트나 튜플 같은 기본 자료 구조에서 사용되는 색인의 의미와 약간 달라서 초보자들은 종종 실수를 한다.

In [0]:
ser = Series(np.arange(3))

In [27]:
ser

0    0
1    1
2    2
dtype: int64

In [0]:
ser[-1] # error 발생

ser 객체는 0, 1, 2 색인을 가지고 있지만, 사용자가 원하는 것이 위치 색인인지, 이름 색인인지 알아맞히는것은 어려운 일이다.

---

반면에, 정수 색인이 아니라면 그리 어렵지는 않다.

In [0]:
ser2 = Series(np.arange(3), index=['a', 'b', 'c'])

In [30]:
ser2

a    0
b    1
c    2
dtype: int64

In [29]:
ser2[-1]

2

일관성을 유지하기 위해서, 색인 값을 가진 축 색인이 있을 경우, 정수 데이터는 항상 이름을 지향하나다.

In [31]:
ser.ix[:1]

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

0    0
1    1
dtype: int64

In [43]:
ser

0    0
1    1
2    2
dtype: int64

In [44]:
ser.iloc[0:1]

0    0
dtype: int64

In [45]:
ser.loc[0:1]

0    0
1    1
dtype: int64

???0:1 이면, 0하나만 말하는거 아님?
iloc은 하나만 제대로 나오는데, loc는 두개?

그래서 .loc을 찾아보면, 아래와 같은 문구가 있음. 일관성이 조금 떨어지는 느낌. 

* Warning Note that contrary to usual python slices, both the start and the stop are included

In [0]:
ser.loc? # 여기에서 확인가능

### Panel 데이터

pandas에는 Panel이라고 하는 자료 구조가 있다. 

panel은 dataframe의 3차원 버전이라고 이해하면 됨. 

pandas개발은 spreadsheet 형식의 데이터를 다루는 데 초점을 맞추고 있고, 계층적 색인을 이용하면, 대개의 경우 N차원 배열은 불필요.

Panel은 DataFrame 객체를 담고 있는 사전이나, 3차원 ndarray를 통해 생성가능.

In [47]:
!pip install pandas_datareader

Collecting pandas_datareader
  Downloading https://files.pythonhosted.org/packages/cc/5c/ea5b6dcfd0f55c5fb1e37fb45335ec01cceca199b8a79339137f5ed269e0/pandas_datareader-0.7.0-py2.py3-none-any.whl (111kB)
    100% |████████████████████████████████| 112kB 4.5MB/s
Requirement already satisfied: wrapt in /usr/local/lib/python3.6/dist-packages (from pandas_datareader) (1.10.11)
Requirement already satisfied: pandas>=0.19.2 in /usr/local/lib/python3.6/dist-packages (from pandas_datareader) (0.22.0)
Requirement already satisfied: requests>=2.3.0 in /usr/local/lib/python3.6/dist-packages (from pandas_datareader) (2.18.4)
Collecting lxml (from pandas_datareader)
  Downloading https://files.pythonhosted.org/packages/03/a4/9eea8035fc7c7670e5eab97f34ff2ef0ddd78a491bf96df5accedb0e63f5/lxml-4.2.5-cp36-cp36m-manylinux1_x86_64.whl (5.8MB)
    100% |████████████████████████████████| 5.8MB 4.2MB/s
Requirement already satisfied: pytz>=2011k in /usr/local/lib/python3.6/dist-packages (from pandas>=0.19.2->pandas_datareader) (2018.7)
Requirement already satisfied: numpy>=1.9.0 in /usr/local/lib/python3.6/dist-packages (from pandas>=0.19.2->pandas_datareader) (1.14.6)
Requirement already satisfied: python-dateutil>=2 in /usr/local/lib/python3.6/dist-packages (from pandas>=0.19.2->pandas_datareader) (2.5.3)
Requirement already satisfied: idna<2.7,>=2.5 in /usr/local/lib/python3.6/dist-packages (from requests>=2.3.0->pandas_datareader) (2.6)
Requirement already satisfied: urllib3<1.23,>=1.21.1 in /usr/local/lib/python3.6/dist-packages (from requests>=2.3.0->pandas_datareader) (1.22)
Requirement already satisfied: certifi>=2017.4.17 in /usr/local/lib/python3.6/dist-packages (from requests>=2.3.0->pandas_datareader) (2018.11.29)
Requirement already satisfied: chardet<3.1.0,>=3.0.2 in /usr/local/lib/python3.6/dist-packages (from requests>=2.3.0->pandas_datareader) (3.0.4)
Requirement already satisfied: six>=1.5 in /usr/local/lib/python3.6/dist-packages (from python-dateutil>=2->pandas>=0.19.2->pandas_datareader) (1.11.0)
Installing collected packages: lxml, pandas-datareader
Successfully installed lxml-4.2.5 pandas-datareader-0.7.0

In [0]:
from pandas_datareader import data as web

In [0]:
pdata = pd.Panel(dict((stk, web.get_data_yahoo(stk)) for stk in ['AAPL', 'GOOG', 'MSFT', 'IBM']))

In [51]:
pdata

<class 'pandas.core.panel.Panel'>
Dimensions: 4 (items) x 2249 (major_axis) x 6 (minor_axis)
Items axis: AAPL to MSFT
Major_axis axis: 2010-01-04 00:00:00 to 2018-12-07 00:00:00
Minor_axis axis: High to Adj Close

In [56]:
pdata = pdata.swapaxes('items', 'minor')

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:1: DeprecationWarning:
Panel is deprecated and will be removed in a future version.
The recommended way to represent these types of 3-dimensional data are with a MultiIndex on a DataFrame, via the Panel.to_frame() method
Alternatively, you can use the xarray package http://xarray.pydata.org/en/stable/.
Pandas provides a `.to_xarray()` method to help automate this conversion.

  """Entry point for launching an IPython kernel.

In [57]:
pdata['Adj Close']

                  AAPL         GOOG         IBM        MSFT
Date
2010-01-04   20.473503   311.349976  101.649574   24.720928
2010-01-05   20.508902   309.978882  100.421654   24.728914
2010-01-06   20.182680   302.164703   99.769310   24.577150
2010-01-07   20.145369   295.130463   99.423950   24.321552
2010-01-08   20.279305   299.064880  100.421654   24.489288
2010-01-11   20.100410   298.612823   99.370209   24.177786
2010-01-12   19.871763   293.332153  100.160728   24.018032
2010-01-13   20.152065   291.648102   99.945816   24.241684
2010-01-14   20.035355   293.019196  101.542137   24.728914
2010-01-15   19.700523   288.126007  101.135361   24.649038
2010-01-19   20.572037   291.911407  102.946564   24.840738
2010-01-20   20.255390   288.329681   99.961174   24.433378
2010-01-21   19.905249   289.606384   99.001846   23.970112
2010-01-22   18.917973   273.227905   96.315765   23.131437
2010-01-25   19.426920   268.255249   96.791580   23.418983
2010-01-26   19.701479   269.457428   96.507637   23.562756
2010-01-27   19.887072   269.298462   96.952751   23.698549
2010-01-28   19.065300   265.418701   94.972717   23.291180
2010-01-29   18.373636   263.257751   93.928993   22.508421
2010-02-01   18.629066   264.787811   95.678764   22.692129
2010-02-02   18.737165   263.843964   96.338768   22.732069
2010-02-03   19.059557   268.662598   96.438553   22.867855
2010-02-04   18.372683   261.687958   94.397118   22.236853
2010-02-05   18.698900   263.928406   94.796196   22.380629
2010-02-08   18.570709   265.011353   93.955933   22.141001
2010-02-09   18.768732   266.486755   94.981209   22.372641
2010-02-10   18.666370   265.498199   94.672852   22.356657
2010-02-11   19.005989   266.466888   95.382065   22.460506
2010-02-12   19.169575   264.837494   95.590210   22.308741
2010-02-16   19.458488   268.901062   96.538391   22.750099
...                ...          ...         ...         ...
2018-10-25  219.035751  1095.569946  124.859749  107.834152
2018-10-26  215.547913  1071.469971  123.220627  106.499908
2018-10-29  211.502045  1020.080017  118.135391  103.403290
2018-10-30  212.558350  1036.209961  113.948723  103.283813
2018-10-31  218.099014  1076.770020  113.978340  106.350555
2018-11-01  221.447327  1070.000000  115.360733  105.464386
2018-11-02  206.758575  1057.790039  114.215317  105.703354
2018-11-05  200.889053  1040.089966  118.550110  107.047546
2018-11-06  203.061493  1055.810059  121.571632  107.256645
2018-11-07  209.219986  1093.390015  123.269997  111.478401
2018-11-08  208.490005  1082.400024  123.379997  111.269310
2018-11-09  204.470001  1066.150024  123.540001  109.098686
2018-11-12  194.169998  1038.630005  120.900002  106.410301
2018-11-13  192.229996  1036.050049  120.839996  106.480003
2018-11-14  186.800003  1043.660034  120.199997  104.970001
2018-11-15  191.410004  1064.709961  121.440002  107.279999
2018-11-16  193.529999  1061.489990  121.570000  108.290001
2018-11-19  185.860001  1020.000000  120.309998  104.620003
2018-11-20  176.979996  1025.760010  117.199997  101.709999
2018-11-21  176.779999  1037.609985  118.570000  103.110001
2018-11-23  172.289993  1023.880005  117.190002  103.070000
2018-11-26  174.619995  1048.619995  119.559998  106.470001
2018-11-27  174.240005  1044.410034  120.029999  107.139999
2018-11-28  180.940002  1086.229980  123.000000  111.120003
2018-11-29  179.550003  1088.300049  121.480003  110.190002
2018-11-30  178.580002  1094.430054  124.269997  110.889999
2018-12-03  184.820007  1106.430054  125.309998  112.089996
2018-12-04  176.690002  1050.819946  121.599998  108.519997
2018-12-06  174.720001  1068.729980  123.910004  109.190002
2018-12-07  168.490005  1036.579956  119.339996  104.820000

[2249 rows x 4 columns]

In [58]:
pdata.loc[:, '6/1/2012', :]

            High         Low        Open       Close       Volume   Adj Close
AAPL   81.807144   80.074287   81.308571   80.141426  130246900.0   53.667721
GOOG  284.474762  282.338654  284.047546  283.645172    6155600.0  283.645172
IBM   191.720001  188.600006  190.119995  189.080002    5206400.0  151.606140
MSFT   28.959999   28.440001   28.760000   28.450001   56634300.0   24.127708

In [59]:
pdata.loc['Adj Close', '5/22/2012':, :]

                  AAPL         GOOG         IBM        MSFT
Date
2012-05-22   53.283173   298.458801  157.812180   25.238676
2012-05-23   54.583275   302.760834  157.250870   24.687433
2012-05-24   54.081974   299.879578  157.226852   24.653509
2012-05-25   53.792103   293.853760  155.791595   24.645023
2012-05-29   54.746853   295.249695  157.523514   25.069065
2012-05-30   55.406948   292.214417  155.976059   24.882488
2012-05-31   55.269192   288.553253  154.669022   24.755281
2012-06-01   53.667721   283.645172  151.606140   24.127708
2012-06-04   53.983429   287.425568  151.173157   24.212513
2012-06-05   53.843765   283.362000  151.702393   24.178593
2012-06-06   54.669357   288.409180  155.543076   24.890968
2012-06-07   54.694237   287.246735  155.903854   24.789200
2012-06-08   55.516956   288.349579  156.465118   25.145395
2012-06-11   54.641617   282.413177  154.356369   24.509335
2012-06-12   55.118996   280.724152  155.992035   24.840088
2012-06-13   54.736320   278.732117  154.829437   24.704391
2012-06-14   54.676064   277.718719  156.433014   24.882488
2012-06-15   54.924778   280.431061  159.640244   25.459175
2012-06-18   56.039288   283.580566  158.990829   25.306528
2012-06-19   56.195232   288.886078  159.503983   26.035873
2012-06-20   56.035473   286.889069  159.383698   26.230927
2012-06-21   55.263435   280.778809  155.061966   25.560947
2012-06-22   55.687241   283.893555  155.310532   26.035873
2012-06-25   54.603352   278.538391  154.637009   25.331966
2012-06-26   54.723888   280.515503  153.907349   25.459175
2012-06-27   54.960175   282.810577  154.749252   25.586390
2012-06-28   54.438801   280.331726  153.466339   25.365891
2012-06-29   55.868996   288.160797  156.817947   25.942581
2012-07-02   56.684093   288.359497  157.018372   25.917143
2012-07-03   57.343227   292.015717  157.098541   26.086754
...                ...          ...         ...         ...
2018-10-25  219.035751  1095.569946  124.859749  107.834152
2018-10-26  215.547913  1071.469971  123.220627  106.499908
2018-10-29  211.502045  1020.080017  118.135391  103.403290
2018-10-30  212.558350  1036.209961  113.948723  103.283813
2018-10-31  218.099014  1076.770020  113.978340  106.350555
2018-11-01  221.447327  1070.000000  115.360733  105.464386
2018-11-02  206.758575  1057.790039  114.215317  105.703354
2018-11-05  200.889053  1040.089966  118.550110  107.047546
2018-11-06  203.061493  1055.810059  121.571632  107.256645
2018-11-07  209.219986  1093.390015  123.269997  111.478401
2018-11-08  208.490005  1082.400024  123.379997  111.269310
2018-11-09  204.470001  1066.150024  123.540001  109.098686
2018-11-12  194.169998  1038.630005  120.900002  106.410301
2018-11-13  192.229996  1036.050049  120.839996  106.480003
2018-11-14  186.800003  1043.660034  120.199997  104.970001
2018-11-15  191.410004  1064.709961  121.440002  107.279999
2018-11-16  193.529999  1061.489990  121.570000  108.290001
2018-11-19  185.860001  1020.000000  120.309998  104.620003
2018-11-20  176.979996  1025.760010  117.199997  101.709999
2018-11-21  176.779999  1037.609985  118.570000  103.110001
2018-11-23  172.289993  1023.880005  117.190002  103.070000
2018-11-26  174.619995  1048.619995  119.559998  106.470001
2018-11-27  174.240005  1044.410034  120.029999  107.139999
2018-11-28  180.940002  1086.229980  123.000000  111.120003
2018-11-29  179.550003  1088.300049  121.480003  110.190002
2018-11-30  178.580002  1094.430054  124.269997  110.889999
2018-12-03  184.820007  1106.430054  125.309998  112.089996
2018-12-04  176.690002  1050.819946  121.599998  108.519997
2018-12-06  174.720001  1068.729980  123.910004  109.190002
2018-12-07  168.490005  1036.579956  119.339996  104.820000

[1648 rows x 4 columns]

In [60]:
pdata

<class 'pandas.core.panel.Panel'>
Dimensions: 6 (items) x 2249 (major_axis) x 4 (minor_axis)
Items axis: High to Adj Close
Major_axis axis: 2010-01-04 00:00:00 to 2018-12-07 00:00:00
Minor_axis axis: AAPL to MSFT

통계 모델에 알맞게 Panel 데이터를 출력하는 다른 방법은 DataFrame을 쌓아 놓는것이다.

In [0]:
stacked =  pdata.loc[:, '5/30/2012':, :].to_frame()

In [62]:
stacked

                         High          Low         Open        Close  \
Date       minor
2012-05-30 AAPL     82.855713    80.937141    81.314285    82.738571
           GOOG    294.037567   289.879608   292.179657   292.214417
           IBM     195.470001   193.770004   194.800003   194.529999
           MSFT     29.480000    29.120001    29.350000    29.340000
2012-05-31 AAPL     83.071426    81.637146    82.962860    82.532860
           GOOG    293.093719   287.629242   292.457855   288.553253
           IBM     194.929993   192.000000   194.100006   192.899994
           MSFT     29.420000    28.940001    29.299999    29.190001
2012-06-01 AAPL     81.807144    80.074287    81.308571    80.141426
           GOOG    284.474762   282.338654   284.047546   283.645172
           IBM     191.720001   188.600006   190.119995   189.080002
           MSFT     28.959999    28.440001    28.760000    28.450001
2012-06-04 AAPL     81.071426    78.357140    80.214287    80.612854
           GOOG    288.369446   283.163300   283.267609   287.425568
           IBM     189.380005   187.000000   188.339996   188.539993
           MSFT     28.780001    28.320000    28.620001    28.549999
2012-06-05 AAPL     80.924286    79.761429    80.181427    80.404289
           GOOG    287.197052   281.404724   285.865723   283.362000
           IBM     189.850006   187.559998   187.919998   189.199997
           MSFT     28.750000    28.389999    28.510000    28.510000
2012-06-06 AAPL     81.978569    80.785713    81.110001    81.637146
           GOOG    289.104645   284.951660   286.377380   288.409180
           IBM     194.000000   190.020004   190.779999   193.990005
           MSFT     29.370001    28.809999    28.879999    29.350000
2012-06-07 AAPL     82.474289    81.500000    82.470001    81.674286
           GOOG    292.045532   286.759918   291.901459   287.246735
           IBM     195.830002   193.940002   195.279999   194.440002
           MSFT     29.700001    29.170000    29.639999    29.230000
2012-06-08 AAPL     82.940002    81.285713    81.657143    82.902855
           GOOG    288.622772   285.433533   286.064423   288.349579
...                       ...          ...          ...          ...
2018-11-27 IBM     120.040001   118.370003   118.379997   120.029999
           MSFT    107.330002   105.360001   106.269997   107.139999
2018-11-28 AAPL    181.289993   174.929993   176.729996   180.940002
           GOOG   1086.839966  1035.760010  1048.760010  1086.229980
           IBM     123.089996   120.220001   121.010002   123.000000
           MSFT    111.330002   107.860001   107.889999   111.120003
2018-11-29 AAPL    182.800003   177.699997   182.660004   179.550003
           GOOG   1094.244995  1076.000000  1076.079956  1088.300049
           IBM     123.120003   121.400002   122.440002   121.480003
           MSFT    111.120003   109.029999   110.330002   110.190002
2018-11-30 AAPL    180.330002   177.029999   180.289993   178.580002
           GOOG   1095.569946  1077.880005  1089.069946  1094.430054
           IBM     124.690002   121.480003   121.660004   124.269997
           MSFT    110.970001   109.360001   110.699997   110.889999
2018-12-03 AAPL    184.940002   181.210007   184.460007   184.820007
           GOOG   1124.650024  1103.665039  1123.140015  1106.430054
           IBM     126.589996   124.360001   125.669998   125.309998
           MSFT    113.419998   110.730003   113.000000   112.089996
2018-12-04 AAPL    182.389999   176.270004   180.949997   176.690002
           GOOG   1104.420044  1049.979980  1103.119995  1050.819946
           IBM     124.919998   121.330002   124.489998   121.599998
           MSFT    112.639999   108.209999   111.940002   108.519997
2018-12-06 AAPL    174.779999   170.419998   171.759995   174.720001
           GOOG   1071.199951  1030.770020  1034.260010  1068.729980
           IBM     123.910004   119.300003   119.720001   123.910004
           MSFT    109.239998   105.000000   105.820000   109.190002
2018-12-07 AAPL    174.490005   168.300003   173.490005   168.490005
           GOOG   1075.260010  1028.500000  1060.010010  1036.579956
           IBM     124.050003   118.870003   123.900002   119.339996
           MSFT    109.449997   104.300003   108.379997   104.820000

                       Volume    Adj Close
Date       minor
2012-05-30 AAPL   132357400.0    55.406948
           GOOG     3838100.0   292.214417
           IBM      3602500.0   155.976059
           MSFT    41585500.0    24.882488
2012-05-31 AAPL   122918600.0    55.269192
           GOOG     5975200.0   288.553253
           IBM      9287500.0   154.669022
           MSFT    39134000.0    24.755281
2012-06-01 AAPL   130246900.0    53.667721
           GOOG     6155600.0   283.645172
           IBM      5206400.0   151.606140
           MSFT    56634300.0    24.127708
2012-06-04 AAPL   139248900.0    53.983429
           GOOG     4896900.0   287.425568
           IBM      4624500.0   151.173157
           MSFT    47926300.0    24.212513
2012-06-05 AAPL    97053600.0    53.843765
           GOOG     4710100.0   283.362000
           IBM      3556500.0   151.702393
           MSFT    45715400.0    24.178593
2012-06-06 AAPL   100363900.0    54.669357
           GOOG     4218800.0   288.409180
           IBM      3641300.0   155.543076
           MSFT    46860500.0    24.890968
2012-06-07 AAPL    94941700.0    54.694237
           GOOG     3539800.0   287.246735
           IBM      3701100.0   155.903854
           MSFT    37792800.0    24.789200
2012-06-08 AAPL    86879100.0    55.516956
           GOOG     2839100.0   288.349579
...                       ...          ...
2018-11-27 IBM      4903800.0   120.029999
           MSFT    29124500.0   107.139999
2018-11-28 AAPL    46062500.0   180.940002
           GOOG     2475400.0  1086.229980
           IBM      5104500.0   123.000000
           MSFT    46788500.0   111.120003
2018-11-29 AAPL    41770000.0   179.550003
           GOOG     1468900.0  1088.300049
           IBM      5200100.0   121.480003
           MSFT    28123200.0   110.190002
2018-11-30 AAPL    39531500.0   178.580002
           GOOG     2580200.0  1094.430054
           IBM      7251600.0   124.269997
           MSFT    33665600.0   110.889999
2018-12-03 AAPL    40802500.0   184.820007
           GOOG     1991200.0  1106.430054
           IBM      5846400.0   125.309998
           MSFT    34732800.0   112.089996
2018-12-04 AAPL    41344300.0   176.690002
           GOOG     2345200.0  1050.819946
           IBM      6000700.0   121.599998
           MSFT    45197000.0   108.519997
2018-12-06 AAPL    43098400.0   174.720001
           GOOG     2769200.0  1068.729980
           IBM      6938000.0   123.910004
           MSFT    49107400.0   109.190002
2018-12-07 AAPL    41695700.0   168.490005
           GOOG     2100500.0  1036.579956
           IBM      6947400.0   119.339996
           MSFT    44393400.0   104.820000

[6572 rows x 6 columns]

익숙한 frame이네~

In [63]:
stacked.to_panel()

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:1: DeprecationWarning:
Panel is deprecated and will be removed in a future version.
The recommended way to represent these types of 3-dimensional data are with a MultiIndex on a DataFrame, via the Panel.to_frame() method
Alternatively, you can use the xarray package http://xarray.pydata.org/en/stable/.
Pandas provides a `.to_xarray()` method to help automate this conversion.

  """Entry point for launching an IPython kernel.

<class 'pandas.core.panel.Panel'>
Dimensions: 6 (items) x 1643 (major_axis) x 4 (minor_axis)
Items axis: High to Adj Close
Major_axis axis: 2012-05-30 00:00:00 to 2018-12-07 00:00:00
Minor_axis axis: AAPL to MSFT

이렇게 해서 pandas의 기본 사용법은 한번 살펴보기는 끝~